Котельников_АБ_70153995/src/BusinessProcesses/ПодборПерсонала/ПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПодборПерсонала</name>
  <task>Task.ЗадачаПодборПерсонала</task>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПодбор</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеЗаявки</name>
    <type>
      <types>DocumentRef.СогласованиеЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОдобрена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОтклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияКандидатов</name>
    <type>
      <types>DocumentRef.РегистрацияКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>НайденыПодходящиеКандидаты</name>
    <type>
      <types>EnumRef.ВариантыОтветаНаВопрос</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеВакансии</name>
    <type>
      <types>DocumentRef.ЗакрытиеВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВакансию</name>
    <type>
      <types>DocumentRef.ЗатратыНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПоискКандидатов</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПубликациюВакансии</name>
    <type>
      <types>EnumRef.ОтветственныеЗаПубликацию</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Котельников_АБ_70153995/src/InformationRegisters/РегистрРегистрации/РегистрРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрРегистрации</name>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/ВариантыОтветаНаВопрос/ВариантыОтветаНаВопрос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтветаНаВопрос</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Enums/ОтветственныеЗаПубликацию/ОтветственныеЗаПубликацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЗаПубликацию</name>
  <enumValues>
    <name>РуководительСлужбыПерсонала</name>
  </enumValues>
  <enumValues>
    <name>МенеджерПоПодбору</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/BusinessProcesses/ПодборПерсонала/ObjectModule.bsl
Процедура ЗаявкаОдобренаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = СогласованиеЗаявки.Согласована;

КонецПроцедуры

Процедура НайденыКандидатыПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если НайденыПодходящиеКандидаты = Перечисления.ВариантыОтветаНаВопрос.Да Тогда
		Результат = Истина;
	ИначеЕсли НайденыПодходящиеКандидаты =  Перечисления.ВариантыОтветаНаВопрос.Нет Тогда
		Результат = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Процедура КтоПубликовалВакансиюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ОтветственныйЗаПубликациюВакансии = Перечисления.ОтветственныеЗаПубликацию.МенеджерПоПодбору Тогда
		Результат = Истина;
	ИначеЕсли ОтветственныйЗаПубликациюВакансии = Перечисления.ОтветственныеЗаПубликацию.РуководительСлужбыПерсонала Тогда
		Результат = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаявкуНаПодборПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ДанныеПользователя = ПолучитьДанныеТекПользователя();
		
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	ЗадачаОбъект.Исполнитель = ДанныеПользователя.ТекПользователь;
	ЗадачаОбъект.Подразделение = ДанныеПользователя.ПодразделениеПользователя;
	ЗадачаОбъект.Должность = ДанныеПользователя.ДолжностьПользователя;
	
КонецПроцедуры


Процедура СоздатьСогласованиеЗаявкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ДанныеПользователя = ПолучитьДанныеТекПользователя();
		
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	ЗадачаОбъект.Исполнитель = ДанныеПользователя.ТекПользователь;
	ЗадачаОбъект.Подразделение = ДанныеПользователя.ПодразделениеПользователя;
	ЗадачаОбъект.Должность = ДанныеПользователя.ДолжностьПользователя;	
	
КонецПроцедуры

Процедура СогласоватьЗаявкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	
	
	//БизнесПроцессОбъект = Задача.БизнесПроцесс.ПолучитьОбъект();
	//Если СогласованиеЗаявки.Согласована Тогда
	//	БизнесПроцессОбъект.ЗаявкаОдобрена = Истина;
	//Иначе
	//	БизнесПроцессОбъект.ЗаявкаОтклонена = Истина;
	//КонецЕсли;
	//БизнесПроцессОбъект.ОтветственныйЗаЗаявку = СогласованиеЗаявки.ОтветственныйЗаЗаявку;
	//БизнесПроцессОбъект.Записать();
	
	//Если СогласованиеЗаявки.Согласована Тогда
	//	БизнесПроцессОбъект = Задача.БизнесПроцесс.ПолучитьОбъект();
	//	БизнесПроцессОбъект.ЗаявкаОдобрена = Истина;
	//	БизнесПроцессОбъект.ОтветственныйЗаЗаявку = СогласованиеЗаявки.ОтветственныйЗаЗаявку;
	//	БизнесПроцессОбъект.Записать();		
	//КонецЕсли;
	
	
КонецПроцедуры


Процедура ОпубликоватьВакансиюПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	
	Если ОтветственныйЗаПубликациюВакансии = Перечисления.ОтветственныеЗаПубликацию.РуководительСлужбыПерсонала Тогда
		ЗадачаОбъект.Подразделение = Справочники.Подразделения.СлужбаПерсонала;
		ЗадачаОбъект.Должность = Справочники.Должности.РуководительСлужбыПерсонала;
	ИначеЕсли ОтветственныйЗаПубликациюВакансии = Перечисления.ОтветственныеЗаПубликацию.МенеджерПоПодбору Тогда
		ЗадачаОбъект.Подразделение = Справочники.Подразделения.СлужбаПерсонала;
		ЗадачаОбъект.Должность = Справочники.Должности.МенеджерПоПодбору;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран ответственный за публикацию вакансии. Выполнение задачи невозможно";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпубликоватьВакансиюПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если Задача.Должность = Справочники.Должности.МенеджерПоПодбору Тогда
		БизнесПроцессОбъект = Задача.БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцессОбъект.ОтветственныйЗаПоискКандидатов = Задача.Исполнитель.Сотрудник;
		БизнесПроцессОбъект.Записать();		
	КонецЕсли;

КонецПроцедуры

Процедура НачатьПоискКандидатовПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	БизнесПроцессОбъект = Задача.БизнесПроцесс.ПолучитьОбъект();
	БизнесПроцессОбъект.ОтветственныйЗаПоискКандидатов = Задача.Исполнитель.Сотрудник;
	БизнесПроцессОбъект.Записать();
	
	ВакансияОбъект = Вакансия.ПолучитьОбъект();
	ВакансияОбъект.ОтветственныйЗаПоискКандидатов = Задача.Исполнитель.Сотрудник;
	ВакансияОбъект.Записать();
		
КонецПроцедуры

Процедура РегистрацияПодходящихКандидатовПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	
	Если ЗадачаОбъект.Должность <> Справочники.Должности.МенеджерПоПодбору  Тогда
		Возврат;
	КонецЕсли;
	
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		
КонецПроцедуры

Процедура ПровестиТелефонныеИнтервьюПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	
	Если ЗадачаОбъект.Должность <> Справочники.Должности.МенеджерПоПодбору  Тогда
		Возврат;
	КонецЕсли;
	
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;	
	
КонецПроцедуры

Процедура ПровестиПервичныеСобеседованияПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	
	Если ЗадачаОбъект.Должность <> Справочники.Должности.МенеджерПоПодбору Тогда
		Возврат;
	КонецЕсли;
	
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;		
	
КонецПроцедуры

Процедура ПроведениеСобеседованийПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	ЗадачаОбъект.Исполнитель = ПолучитьПользователяПоСотруднику(ЗадачаОбъект.БизнесПроцесс.ИнициаторЗаявки);
	
КонецПроцедуры


Процедура ФиксированиеЗатратНаВакансиюПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	ЗадачаОбъект.Исполнитель = ПолучитьПользователяПоСотруднику(ЗадачаОбъект.БизнесПроцесс.ОтветственныйЗаПоискКандидатов);
		
КонецПроцедуры

Процедура ПроведениеТестированийПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	ЗадачаОбъект.Исполнитель = ПолучитьПользователяПоСотруднику(ЗадачаОбъект.БизнесПроцесс.ИнициаторЗаявки);	
	
КонецПроцедуры

Функция ПолучитьДанныеТекПользователя()
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрРегистрации.Подразделение КАК Подразделение,
		|	РегистрРегистрации.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.РегистрРегистрации КАК РегистрРегистрации
		|ГДЕ
		|	РегистрРегистрации.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Исполнитель", ТекПользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("ТекПользователь", ТекПользователь);
	ДанныеПользователя.Вставить("ПодразделениеПользователя", Выборка.Подразделение);
	ДанныеПользователя.Вставить("ДолжностьПользователя", Выборка.Должность);
	
	Возврат ДанныеПользователя;
	
КонецФункции

Функция ПолучитьПользователяПоСотруднику(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.Пользователь;
	
КонецФункции

Процедура СогласоватьЗаявкуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	БизнесПроцессОбъект = Задача.БизнесПроцесс.ПолучитьОбъект();
	Если СогласованиеЗаявки.Согласована Тогда
		БизнесПроцессОбъект.ЗаявкаОдобрена = Истина;
	Иначе
		БизнесПроцессОбъект.ЗаявкаОтклонена = Истина;
	КонецЕсли;
	БизнесПроцессОбъект.ОтветственныйЗаЗаявку = СогласованиеЗаявки.ОтветственныйЗаЗаявку;
	БизнесПроцессОбъект.Записать();	
	
КонецПроцедуры
